wolaite2024/jlab-jh5003-dongle/src/mcu/rtl87x3/arm/startup_rtl87x3d_gcc.s
;/*****************************************************************************/
;/*     startup_rtl87x3d_gcc.s: Startup file for Realtek RTL87x3d device series     */
;/*****************************************************************************/
#include "mem_config.h"
/**
**===========================================================================
**  Definitions
**===========================================================================
*/
    .syntax unified
    .cpu cortex-m4
    .fpu fpv4-sp-d16
    .thumb

  .global    g_pfnVectors
  .global    Default_Handler
  .type    Default_Handler, %function 


.equ _estack, APP_GLOBAL_ADDR
/**
**===========================================================================
**  Program - Reset_Handler
**  Abstract: This code gets called after a reset event.  
**===========================================================================
*/
  .section RESET
  .weak    Reset_Handler
  .type    Reset_Handler, %function
Reset_Handler:
    IF     :DEF:__USE_C_LIBRARY_INIT; // use c library init

    LDR    R0, =system_init
    BLX    R0
    LDR    R0, =__main
    BX     R0

    ELSE

    ; write our init flow: copy rw, encrypted and clear zi
    ; data on rw, data on zi, buffer on rw, buffer on zi

    ; copy data on rw
    IMPORT |Load$$RAM_GLOBAL$$RW$$Base|
    IMPORT |Image$$RAM_GLOBAL$$RW$$Base|
    IMPORT |Image$$RAM_GLOBAL$$RW$$Length|
    LDR R0, =|Load$$RAM_GLOBAL$$RW$$Base|
    LDR R1, =|Image$$RAM_GLOBAL$$RW$$Base|
    LDR R2, =|Image$$RAM_GLOBAL$$RW$$Length|
    CMP R2, #0
    BEQ end_of_copy_data_on_rw
/**
**===========================================================================
**  Program - Default_Handler
**  Abstract: This code gets called when the processor receives an
**    unexpected interrupt.
**===========================================================================
*/
  .section    .text,"ax",%progbits
  Default_Handler:
    b   .
    .size  Default_Handler, .-Default_Handler 
/**
**===========================================================================
**  Reset, Exception, and Interrupt vectors
**===========================================================================
*/

  .section VECTOR,"a",%progbits
  .type    g_pfnVectors, %object
  .size    g_pfnVectors, .-g_pfnVectors

g_pfnVectors:
  /* Processor exception vectors */
  .word    _estack
  .word    Reset_Handler             ; Reset Handler
  .word    NMI_Handler               ; NMI Handler
  .word    HardFault_Handler         ; Hard Fault Handler
  .word    MemManage_Handler         ; MPU Fault Handler
  .word    BusFault_Handler          ; Bus Fault Handler
  .word    UsageFault_Handler        ; Usage Fault Handler
  .word    0                         ; Reserved
  .word    0                         ; Reserved
  .word    0                         ; Reserved
  .word    0                         ; Reserved
  .word    SVC_Handler               ; SVCall Handler
  .word    DebugMon_Handler          ; Debug Monitor Handler
  .word    0                         ; Reserved
  .word    PendSV_Handler            ; PendSV Handler
  .word    SysTick_Handler           ; SysTick Handler

  ; External Interrupts
  .word    System_Handler            ;[0]  System On interrupt
  .word    WDT_Handler               ;[1]  Watch dog global insterrupt
  .word    BTMAC_Handler             ;[2]  See Below Table ( an Extension of interrupt )
  .word    USB_IP_Handler  ;[3]  Master Peripheral IP interrupt (usb or sdio)
  .word    TIM2_Handler              ;[4]  Timer2 global interrupt
  .word    Platform_Handler          ;[5]  Platform interrupt (platfrom error interrupt)
  .word    I2S0_TX_Handler            ;[6]  I2S0 interrupt
  .word    I2S0_RX_Handler            ;[7]  I2S1 interrupt
  .word    UART2_Handler             ;[8]  Data_Uart1 interrupt (used for DSP)
  .word    GPIOA0_Handler            ;[9]  GPIOA0 interrupt
  .word    GPIOA1_Handler            ;[10] GPIOA1 interrupt
  .word    UART1_Handler             ;[11] Log_Uart interrupt (Log0)
  .word    UART0_Handler             ;[12] Data_Uart interrupt
  .word    RTC_Handler               ;[13] Realtime counter interrupt
  .word    SPI0_Handler              ;[14] SPI0 interrupt
  .word    SPI1_Handler              ;[15] SPI1 interrupt
  .word    I2C0_Handler              ;[16] I2C0 interrupt
  .word    I2C1_Handler              ;[17] I2C1 interrupt
  .word    ADC_Handler               ;[18] ADC global interrupt
  .word    Peripheral_Handler        ;[19] See Below Table ( an Extension of interrupt )
  .word    GDMA0_Channel0_Handler    ;[20] RTK-DMA0 channel 0 global interrupt
  .word    GDMA0_Channel1_Handler    ;[21] RTK-DMA0 channel 1 global interrupt
  .word    GDMA0_Channel2_Handler    ;[22] RTK-DMA0 channel 2 global interrupt
  .word    GDMA0_Channel3_Handler    ;[23] RTK-DMA0 channel 3 global interrupt
  .word    GDMA0_Channel4_Handler    ;[24] RTK-DMA0 channel 4 global interrupt
  .word    GDMA0_Channel5_Handler    ;[25] RTK-DMA0 channel 5 global interrupt
  .word    KeyScan_Handler           ;[26] keyscan global interrupt
  .word    QDEC_Handler              ;[27] qdecode global interrupt
  .word    IR_Handler                ;[28] IR module global interrupt
  .word    DSP_Handler               ;[29] DSP interrupt
  .word    GDMA0_Channel6_Handler    ;[30] RTK-DMA0 channel 6 global interrupt
  .word    GDMA0_Channel7_Handler    ;[31] RTK-DMA0 channel 7 global interrupt
  .word    GDMA0_Channel8_Handler    ;[32] RTK-DMA0 channel 8 global interrupt
  .word    GDMA0_Channel9_Handler    ;[33] RTK-DMA0 channel 9 global interrupt
  .word    GDMA0_Channel10_Handler   ;[34] RTK-DMA0 channel 6 global interrupt
  .word    GDMA0_Channel11_Handler   ;[35] RTK-DMA0 channel 7 global interrupt
  .word    GDMA0_Channel12_Handler   ;[36] RTK-DMA0 channel 8 global interrupt
  .word    GDMA0_Channel13_Handler   ;[37] RTK-DMA0 channel 9 global interrupt
  .word    GDMA0_Channel14_Handler   ;[38] RTK-DMA0 channel 6 global interrupt
  .word    GDMA0_Channel15_Handler   ;[39] RTK-DMA0 channel 7 global interrupt
  .word    TIM3_Handler              ;[40] Timer3 global interrupt
  .word    TIM4_Handler              ;[41] Timer4 global interrupt
  .word    TIM5_Handler              ;[42] Timer5 global interrupt
  .word    TIM6_Handler              ;[43] Timer6 global interrupt
  .word    TIM7_Handler              ;[44] Timer7 global interrupt
  .word    TIM8to11_Handler              ;[45] TRNG interrupt
  .word    GPIO_A_9_Handler          ;[46] GPIO_A[9] interrupt
  .word    GPIO_A_16_Handler         ;[47] GPIO_A[16] interrupt
  .word    GPIO_A_2to7_Handler       ;[48] GPIO_A[2:7] interrupt
  .word    GPIO_A_8_10to15_Handler   ;[49] GPIO_A[8,10:15] interrupt
  .word    GPIO_A_17to23_Handler     ;[50] GPIO_A[17:23] interrupt
  .word    GPIO_A_24to31_Handler     ;[51] GPIO_A[24:31] interrupt
  .word    GPIO_B_0to7_Handler       ;[52] GPIO_B[0:7] interrupt
  .word    GPIO_B_8to15_Handler      ;[53] GPIO_B[8:15] interrupt
  .word    GPIO_B_16to23_Handler     ;[54] GPIO_B[16:23] interrupt
  .word    GPIO_B_24to31_Handler     ;[55] GPIO_B[24:31] interrupt
  .word    UART3_Handler             ;[56] Uart3 interrupt(used for DSP)
  .word    SPI2_Handler              ;[57] SPI2 interrupt
  .word    I2C2_Handler              ;[58] I2C2 interrupt
  .word    DSP_Event_1_Handler       ;[59] DSP event interrupt 1
  .word    DSP_Event_2_Handler       ;[60] DSP event interrupt 2
  .word    SHA256_Handler            ;[61] SHA256 interrupt
  .word    USB_ISOC_Handler          ;[62] USB ISO interrupt
  .word    BT_CLK_compare_Handler    ;[63] BT clock compare interrupt
  .word    HW_RSA_Handler            ;[64] HW RSA interrupt
  .word    PSRAM_Handler             ;[65] PSRAM interrupt
  .word    Compare_clk_4_Handler     ;[66] Compare Clock interrupt 4
  .word    Compare_clk_5_Handler     ;[67] Compare Clock interrupt 5
  .word    dspdma_int_all_host_Handler    ;[68] RTK-DMA0 channel 0 global interrupt
  .word    NNA_Handler    ;[69] RTK-DMA0 channel 1 global interrupt
  .word    Compare_clk_9_Handler     ;[70] RTK-DMA0 channel 2 global interrupt
  .word    Compare_clk_10_Handler    ;[71] RTK-DMA0 channel 3 global interrupt
  .word    GPIO_C_0to7_Handler       ;[72] RTK-DMA0 channel 4 global interrupt
  .word    GPIO_C_8to15_Handler      ;[73] RTK-DMA0 channel 5 global interrupt
  .word    0                         ;[74] RTK-DMA0 channel 6 global interrupt
  .word    0                         ;[75] RTK-DMA0 channel 7 global interrupt
  .word    TIM8_Handler              ;[76] Timer8 global interrupt
  .word    TIM9_Handler              ;[77] Timer9 global interrupt
  .word    TIM10_Handler             ;[78] Timer10 global interrupt
  .word    TIM11_Handler             ;[79] Timer11 global interrupt
  .word    TIM12_Handler             ;[80] Timer12 global interrupt
  .word    TIM13_Handler             ;[81] Timer13 global interrupt
  .word    TIM14_Handler             ;[82] Timer14 global interrupt
  .word    TIM15_Handler             ;[83] Timer15 global interrupt
  .word    SPIC0_Handler             ;[84] SPIC0 interrupt
  .word    SPIC1_Handler             ;[85] SPIC1 interrupt
  .word    SPIC2_Handler             ;[86] SPIC2 interrupt
  .word    SPIC3_Handler             ;[87] SPIC3 interrupt
  .word    SDIO_HOST_Handler         ;[88] SDIO host interrupt
  .word    SPIC4_Handler
  .word    ERR_CORR_CODE_Handler
  .word    SLAVE_PORT_MONITOR_Handler
   ;       Name,                     IRQ_NUM,  StatusBit
  .word    RESERVED0_Handler         ;19,      0,
  .word    RESERVED1_Handler         ;19,      1,
  .word    RESERVED2_Handler         ;19,      2,
  .word    RESERVED3_Handler         ;19,      3,
  .word    RESERVED4_Handler         ;19,      4,
  .word    RESERVED5_Handler         ;19,      5,
  .word    RESERVED6_Handler         ;19,      6,
  .word    SPDIF_Rx_Handler          ;19,      7,
  .word    SPDIF_Tx_Handler          ;19,      8,
  .word    MBIAS_MFG_DET_L_Handler   ;19,      9,
  .word    SPI2W_Handler             ;19,      10,
  .word    LPCOMP_Handler            ;19,      11,
  .word    MBIAS_VBAT_DET_Handler    ;19,      12,
  .word    MBIAS_ADP_DET_Handler     ;19,      13,
  .word    HW_ASRC1_Handler          ;19,      14,
  .word    HW_ASRC2_Handler          ;19,      15,
  .word    VADBUF_Handler            ;19,      16,
  .word    PTA_Mailbox_Handler       ;19,      17,
  .word    DSP2MCU_Handler           ;19,      18,
  .word    SPORT2_TX_Handler         ;19,      19,
  .word    SPORT2_RX_Handler         ;19,      20,
  .word    SPORT3_TX_Handler         ;19,      21,
  .word    SPORT3_RX_Handler         ;19,      22,
  .word    VAD_Handler               ;19,      23,
  .word    ANC_Handler               ;19,      24,
  .word    SPORT0_TX_Handler         ;19,      25,
  .word    SPORT0_RX_Handler         ;19,      26,
  .word    SPORT1_TX_Handler         ;19,      27,
  .word    SPORT1_RX_Handler         ;19,      28,
  .word    USB_UTMI_SUSPEND_N_Handler;19,      29,
  .word    USB_DLPS_Resume_Handler   ;19,      30,
  .word    RESERVED7_Handler        ;19,      31,
  .word    ADP_IN_DET_Handler
  .word    ADP_OUT_DET_Handler
  .word    GPIOA2_Handler
  .word    GPIOA3_Handler
  .word    GPIOA4_Handler
  .word    GPIOA5_Handler
  .word    GPIOA6_Handler
  .word    GPIOA7_Handler
  .word    GPIOA8_Handler
  .word    GPIOA9_Handler
  .word    GPIOA10_Handler
  .word    GPIOA11_Handler
  .word    GPIOA12_Handler
  .word    GPIOA13_Handler
  .word    GPIOA14_Handler
  .word    GPIOA15_Handler
  .word    GPIOA16_Handler
  .word    GPIOA17_Handler
  .word    GPIOA18_Handler
  .word    GPIOA19_Handler
  .word    GPIOA20_Handler
  .word    GPIOA21_Handler
  .word    GPIOA22_Handler
  .word    GPIOA23_Handler
  .word    GPIOA24_Handler
  .word    GPIOA25_Handler
  .word    GPIOA26_Handler
  .word    GPIOA27_Handler
  .word    GPIOA28_Handler
  .word    GPIOA29_Handler
  .word    GPIOA30_Handler
  .word    GPIOA31_Handler
  .word    GPIOB0_Handler
  .word    GPIOB1_Handler
  .word    GPIOB2_Handler
  .word    GPIOB3_Handler
  .word    GPIOB4_Handler
  .word    GPIOB5_Handler
  .word    GPIOB6_Handler
  .word    GPIOB7_Handler
  .word    GPIOB8_Handler
  .word    GPIOB9_Handler
  .word    GPIOB10_Handler
  .word    GPIOB11_Handler
  .word    GPIOB12_Handler
  .word    GPIOB13_Handler
  .word    GPIOB14_Handler
  .word    GPIOB15_Handler
  .word    GPIOB16_Handler
  .word    GPIOB17_Handler
  .word    GPIOB18_Handler
  .word    GPIOB19_Handler
  .word    GPIOB20_Handler
  .word    GPIOB21_Handler
  .word    GPIOB22_Handler
  .word    GPIOB23_Handler
  .word    GPIOB24_Handler
  .word    GPIOB25_Handler
  .word    GPIOB26_Handler
  .word    GPIOB27_Handler
  .word    GPIOB28_Handler
  .word    GPIOB29_Handler
  .word    GPIOB30_Handler
  .word    GPIOB31_Handler
  .word    GPIOC0_Handler
  .word    GPIOC1_Handler
  .word    GPIOC2_Handler
  .word    GPIOC3_Handler
  .word    GPIOC4_Handler
  .word    GPIOC5_Handler
  .word    GPIOC6_Handler
  .word    GPIOC7_Handler
  .word    GPIOC8_Handler
  .word    GPIOC9_Handler
  .word    GPIOC10_Handler
  .word    GPIOC11_Handler
  .word    GPIOC12_Handler
  .word    GPIOC13_Handler
  .word    GPIOC14_Handler
  .word    GPIOC15_Handler
  

copy_data_on_rw:
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_data_on_rw
end_of_copy_data_on_rw:

