wolaite2024/jlab-jh5003-dongle/src/mcu/rtl87x3/arm/startup_rtl87x3d_gcc.s
                ; clear data on zi
                IMPORT |Image$$RAM_GLOBAL$$ZI$$Base|
                IMPORT |Image$$RAM_GLOBAL$$ZI$$Length|
                LDR R0, =|Image$$RAM_GLOBAL$$ZI$$Base|
                LDR R1, =|Image$$RAM_GLOBAL$$ZI$$Length|
                CMP R1, #0
                BEQ end_of_clear_data_on_zi
clear_data_on_zi:
                STR R2, [R0]
                ADDS R0, R0, #4
                SUBS R1, R1, #4
                BNE clear_data_on_zi
end_of_clear_data_on_zi:

                ; copy buffer on rw
                IMPORT |Load$$RAM_TEXT$$RW$$Base|
                IMPORT |Image$$RAM_TEXT$$RW$$Base|
                IMPORT |Image$$RAM_TEXT$$RW$$Length|
                LDR R0, =|Load$$RAM_TEXT$$RW$$Base|
                LDR R1, =|Image$$RAM_TEXT$$RW$$Base|
                LDR R2, =|Image$$RAM_TEXT$$RW$$Length|
                CMP R2, #0
                BEQ end_of_copy_buffer_on_rw
copy_buffer_on_rw:
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_buffer_on_rw
end_of_copy_buffer_on_rw:

                ; copy buffer on ro (for ram function)
                IMPORT |Load$$RAM_TEXT$$RO$$Base|
                IMPORT |Image$$RAM_TEXT$$RO$$Base|
                IMPORT |Image$$RAM_TEXT$$RO$$Length|
                LDR R0, =|Load$$RAM_TEXT$$RO$$Base|
                LDR R1, =|Image$$RAM_TEXT$$RO$$Base|
                LDR R2, =|Image$$RAM_TEXT$$RO$$Length|
                CMP R2, #0
                BEQ end_of_copy_buffer_on_ro
copy_buffer_on_ro:
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_buffer_on_ro
end_of_copy_buffer_on_ro:

                ; clear buffer on zi
                IMPORT |Image$$RAM_TEXT$$ZI$$Base|
                IMPORT |Image$$RAM_TEXT$$ZI$$Length|
                LDR R0, =|Image$$RAM_TEXT$$ZI$$Base|
                LDR R1, =|Image$$RAM_TEXT$$ZI$$Length|
                CMP R1, #0
                BEQ end_of_clear_buffer_on_zi
clear_buffer_on_zi:
                STR R2, [R0]
                ADDS R0, R0, #4
                SUBS R1, R1, #4
                BNE clear_buffer_on_zi
				NOP
end_of_clear_buffer_on_zi:


                IMPORT system_init
                IMPORT main
                LDR    R0, =system_init
                BLX    R0
                LDR    R0, =main
                BX     R0

                ENDIF ; end of macro __USE_C_LIBRARY_INIT

                ENDP ; end of Reset_Handler


                AREA    |.text|, CODE, READONLY
				
/**
**===========================================================================
** Provide weak aliases for each Exception handler to the Default_Handler.
**===========================================================================
*/
  .weak  NMI_Handler
  .thumb_set NMI_Handler,Default_Handler
  
  .weak  HardFault_Handler
  .thumb_set HardFault_Handler,Default_Handler
  
  .weak  MemManage_Handler
  .thumb_set MemManage_Handler,Default_Handler
  
  .weak  BusFault_Handler
  .thumb_set BusFault_Handler,Default_Handler
  
  .weak  UsageFault_Handler
  .thumb_set UsageFault_Handler,Default_Handler
  
  .weak  SVC_Handler
  .thumb_set SVC_Handler,Default_Handler
  
  .weak  DebugMon_Handler
  .thumb_set DebugMon_Handler,Default_Handler
  
  .weak  PendSV_Handler
  .thumb_set PendSV_Handler,Default_Handler
  
  .weak  SysTick_Handler
  .thumb_set SysTick_Handler,Default_Handler
  
  .weak  System_Handler
  .thumb_set System_Handler,Default_Handler
  
  .weak  WDT_Handler
  .thumb_set WDT_Handler,Default_Handler
  
  .weak  BTMAC_Handler
  .thumb_set BTMAC_Handler,Default_Handler
  
  .weak  USB_IP_Handler
  .thumb_set USB_IP_Handler,Default_Handler
  
  .weak  TIM2_Handler
  .thumb_set TIM2_Handler,Default_Handler
  
  .weak  Platform_Handler
  .thumb_set Platform_Handler,Default_Handler
  
  .weak  I2S0_TX_Handler
  .thumb_set I2S0_TX_Handler,Default_Handler
  
  .weak  I2S0_RX_Handler
  .thumb_set I2S0_RX_Handler,Default_Handler
  
  .weak  UART2_Handler
  .thumb_set UART2_Handler,Default_Handler
  
  .weak  GPIOA0_Handler
  .thumb_set GPIOA0_Handler,Default_Handler
  
  .weak  GPIOA1_Handler
  .thumb_set GPIOA1_Handler,Default_Handler
  
  .weak  UART1_Handler
  .thumb_set UART1_Handler,Default_Handler
  
  .weak  UART0_Handler
  .thumb_set UART0_Handler,Default_Handler
  
  .weak  RTC_Handler
  .thumb_set RTC_Handler,Default_Handler
  
  .weak  SPI0_Handler
  .thumb_set SPI0_Handler,Default_Handler
  
  .weak  SPI1_Handler
  .thumb_set SPI1_Handler,Default_Handler
  
  .weak  I2C0_Handler
  .thumb_set I2C0_Handler,Default_Handler
  
  .weak  I2C1_Handler
  .thumb_set I2C1_Handler,Default_Handler
  
  .weak  ADC_Handler
  .thumb_set ADC_Handler,Default_Handler
  
  .weak  Peripheral_Handler
  .thumb_set Peripheral_Handler,Default_Handler
  
  .weak  GDMA0_Channel0_Handler
  .thumb_set GDMA0_Channel0_Handler,Default_Handler
  
  .weak  GDMA0_Channel1_Handler
  .thumb_set GDMA0_Channel1_Handler,Default_Handler
  
  .weak  GDMA0_Channel2_Handler
  .thumb_set GDMA0_Channel2_Handler,Default_Handler
  
  .weak  GDMA0_Channel3_Handler
  .thumb_set GDMA0_Channel3_Handler,Default_Handler
  
  .weak  GDMA0_Channel4_Handler
  .thumb_set GDMA0_Channel4_Handler,Default_Handler
  
  .weak  GDMA0_Channel5_Handler
  .thumb_set GDMA0_Channel5_Handler,Default_Handler
  
  .weak  KeyScan_Handler
  .thumb_set KeyScan_Handler,Default_Handler
  
  .weak  QDEC_Handler
  .thumb_set QDEC_Handler,Default_Handler
  
  .weak  IR_Handler
  .thumb_set IR_Handler,Default_Handler
  
  .weak  DSP_Handler
  .thumb_set DSP_Handler,Default_Handler
  
  .weak  GDMA0_Channel6_Handler
  .thumb_set GDMA0_Channel6_Handler,Default_Handler
  
  .weak  GDMA0_Channel7_Handler
  .thumb_set GDMA0_Channel7_Handler,Default_Handler
  
  .weak  GDMA0_Channel8_Handler
  .thumb_set GDMA0_Channel8_Handler,Default_Handler
  
  .weak  GDMA0_Channel9_Handler
  .thumb_set GDMA0_Channel9_Handler,Default_Handler
  
